tutorials/rhoImplicitPorousSimpleFoam/angledDuctImplicit/0/T
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          T;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{

    front
    {
        type            zeroGradient;
    }
    back
    {
        type            zeroGradient;
    }
    wall
    {
        type            zeroGradient;
    }
    porosityWall
    {
        type            zeroGradient;
    }

    inlet
    {
        type        fixedValue;
        value       uniform 293;
    }
    outlet
    {
        type            inletOutlet;
        value           uniform 293;
        inletValue      uniform 293;
    }
}

// ************************************************************************* //
