tutorials/rhoImplicitPorousSimpleFoam/angledDuctImplicit/constant/polyMesh/boundary
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format binary;

    root "";
    case "";
    instance "";
    local "";

    class polyBoundaryMesh;
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
front
{
    type wall;
    nFaces 700;
    startFace 63400;
}

back
{
    type wall;
    nFaces 700;
    startFace 64100;
}

wall
{
    type wall;
    nFaces 1400;
    startFace 64800;
}

porosityWall
{
    type wall;
    nFaces 1600;
    startFace 66200;
}

inlet
{
    type patch;
    nFaces 400;
    startFace 67800;
}

outlet
{
    type patch;
    nFaces 400;
    startFace 68200;
}
)

// ************************************************************************* //
